IoTCoreTeam/iot-core-esp32-gateway/src/main.cpp
#include <WiFi.h>
#include <PubSubClient.h> 
#include <ESP32Servo.h>
#include <ArduinoJson.h>
#include <Arduino.h>
#include <esp_now.h>
#include "esp_wifi.h"
#include <time.h>

// WiFi & MQTT Config
#if defined(WIFI_PROFILE_HOME)
#define WIFI_SSID "Tien Thuat"
#define WIFI_PASSWORD "07112004tien"
#elif defined(WIFI_PROFILE_OFFICE)
#define WIFI_SSID "OrsCorp"
#define WIFI_PASSWORD "Tamchiduc68"
#endif

#ifndef WIFI_SSID
#define WIFI_SSID "OrsCorp"
#endif
#ifndef WIFI_PASSWORD
#define WIFI_PASSWORD "Tamchiduc68"
#endif
#ifndef MQTT_SERVER
#define MQTT_SERVER "192.168.1.249"
#endif

const char* ssid = WIFI_SSID;
const char* password = WIFI_PASSWORD;
const char* mqtt_server = MQTT_SERVER;

// Security: Gateway Credentials
#ifndef GATEWAY_ID
#define GATEWAY_ID "GW_001"
#endif
#ifndef GATEWAY_SECRET
#define GATEWAY_SECRET "x8z93-secure-key-abc"
#endif

const char* gateway_id = GATEWAY_ID;
const char* gateway_secret = GATEWAY_SECRET; // Change this!

// ESP32 Gateway - Updated Ä‘á»ƒ gá»­i node_id trong payload

// THÃŠM: Node configuration
#ifndef NODE_ID
#define NODE_ID "node-sensor-001"
#endif
#ifndef NODE_NAME
#define NODE_NAME "Environmental Node"
#endif

const char* node_id = NODE_ID; // Environmental Node
const char* node_name = NODE_NAME;

// Message types
const uint8_t MSG_TYPE_DATA = 1;
const uint8_t MSG_TYPE_HEARTBEAT = 2;

// Relay control action
const char* ACTION_RELAY_CONTROL = "relay_control";

// Per-gateway node whitelist (edit per device)
#if defined(GATEWAY_3)
const char* allowed_node_ids[] = { "node-sensor-003" };
#elif defined(GATEWAY_2)
const char* allowed_node_ids[] = { "node-sensor-002" };
#else
const char* allowed_node_ids[] = { "node-sensor-001", "node-control-001" };
#endif
const size_t allowed_node_count = sizeof(allowed_node_ids) / sizeof(allowed_node_ids[0]);

#ifndef CONTROL_NODE_ID
#define CONTROL_NODE_ID "node-control-001"
#endif

#ifndef CONTROL_NODE_MAC_0
#define CONTROL_NODE_MAC_0 0x00
#endif
#ifndef CONTROL_NODE_MAC_1
#define CONTROL_NODE_MAC_1 0x70
#endif
#ifndef CONTROL_NODE_MAC_2
#define CONTROL_NODE_MAC_2 0x07
#endif
#ifndef CONTROL_NODE_MAC_3
#define CONTROL_NODE_MAC_3 0xE6
#endif
#ifndef CONTROL_NODE_MAC_4
#define CONTROL_NODE_MAC_4 0xB6
#endif
#ifndef CONTROL_NODE_MAC_5
#define CONTROL_NODE_MAC_5 0x7C
#endif

uint8_t controlNodeAddress[] = {
    CONTROL_NODE_MAC_0,
    CONTROL_NODE_MAC_1,
    CONTROL_NODE_MAC_2,
    CONTROL_NODE_MAC_3,
    CONTROL_NODE_MAC_4,
    CONTROL_NODE_MAC_5
};

typedef struct control_command_message {
    char gateway_id[32];
    char node_id[32];
    char action_type[24];
    char device[16];
    char state[8];
    uint32_t command_seq;
} control_command_message;

static uint32_t controlCommandSeq = 0;
static bool espNowReady = false;

String getISOTimestamp();
extern PubSubClient client;
bool ensureEspNowReady();
bool addControlNodePeer();
void OnDataRecv(const uint8_t *mac, const uint8_t *incomingData, int len);

bool isNodeWhitelisted(const char* nodeId) {
    if (!nodeId) {
        return false;
    }
    for (size_t i = 0; i < allowed_node_count; i++) {
        if (strcmp(allowed_node_ids[i], nodeId) == 0) {
            return true;
        }
    }
    return false;
}

bool isControlNode(const char* nodeId) {
    if (!nodeId) {
        return false;
    }
    return strncmp(nodeId, "node-control-", 13) == 0;
}

bool ensureEspNowReady() {
    esp_err_t initResult = esp_now_init();
    if (initResult != ESP_OK && initResult != ESP_ERR_ESPNOW_EXIST) {
        Serial.printf("ESP-NOW init error: %d\n", initResult);
        espNowReady = false;
        return false;
    }

    esp_now_register_recv_cb(OnDataRecv);
    espNowReady = true;

#ifndef GATEWAY_2
    addControlNodePeer();
#endif
    return true;
}

bool addControlNodePeer() {
#ifdef GATEWAY_2
    return false;
#else
    esp_now_peer_info_t peerInfo = {};
    memcpy(peerInfo.peer_addr, controlNodeAddress, 6);
    peerInfo.channel = 0;
    peerInfo.encrypt = false;
    peerInfo.ifidx = WIFI_IF_STA;

    if (esp_now_is_peer_exist(controlNodeAddress)) {
        return true;
    }

    if (esp_now_add_peer(&peerInfo) != ESP_OK) {
        Serial.println("Failed to add control-node ESP-NOW peer");
        return false;
    }

    Serial.println("Control-node peer ready");
    return true;
#endif
}

void publishControlAck(const char* nodeId, const char* device, const char* state, const char* status) {
    if (!client.connected()) {
        return;
    }

    StaticJsonDocument<256> ackDoc;
    ackDoc["gateway_id"] = gateway_id;
    ackDoc["node_id"] = nodeId;
    ackDoc["device"] = device;
    ackDoc["state"] = state;
    ackDoc["status"] = status;
    ackDoc["timestamp"] = getISOTimestamp();

    String ackPayload;
    serializeJson(ackDoc, ackPayload);
    client.publish("esp32/control/ack", ackPayload.c_str());
}

void sendControlCommandToNode(const char* targetNodeId, const char* device, const char* state) {
#ifdef GATEWAY_2
    Serial.println("Relay control ignored: gateway 2 has no control node");
    publishControlAck(targetNodeId, device, state, "unsupported_gateway");
#else
    if (!ensureEspNowReady()) {
        publishControlAck(targetNodeId, device, state, "espnow_not_ready");
        return;
    }

    if (!targetNodeId || strlen(targetNodeId) == 0) {
        targetNodeId = CONTROL_NODE_ID;
    }
    if (strcmp(targetNodeId, CONTROL_NODE_ID) != 0) {
        Serial.printf("Relay control ignored: node mismatch %s\n", targetNodeId);
        publishControlAck(targetNodeId, device, state, "node_mismatch");
        return;
    }

    if (!addControlNodePeer()) {
        publishControlAck(targetNodeId, device, state, "peer_add_failed");
        return;
    }

    control_command_message command = {};
    strncpy(command.gateway_id, gateway_id, sizeof(command.gateway_id) - 1);
    strncpy(command.node_id, targetNodeId, sizeof(command.node_id) - 1);
    strncpy(command.action_type, ACTION_RELAY_CONTROL, sizeof(command.action_type) - 1);
    strncpy(command.device, device, sizeof(command.device) - 1);
    strncpy(command.state, state, sizeof(command.state) - 1);
    command.command_seq = ++controlCommandSeq;

    esp_err_t result = esp_now_send(
        controlNodeAddress,
        reinterpret_cast<const uint8_t*>(&command),
        sizeof(command)
    );

    if (result == ESP_OK) {
        Serial.printf("Relay command sent: node=%s device=%s state=%s seq=%lu\n",
                      targetNodeId, device, state, (unsigned long)command.command_seq);
        publishControlAck(targetNodeId, device, state, "dispatched");
    } else {
        Serial.printf("Relay command send failed (%d)\n", result);
        publishControlAck(targetNodeId, device, state, "dispatch_failed");
    }
#endif
}

