IoTCoreTeam/iot-core-esp32-gateway/src/main.cpp
// NTP Servers for timestamps (fallbacks)
const char* ntpServer1 = "pool.ntp.org";
const char* ntpServer2 = "time.google.com";
const char* ntpServer3 = "time.cloudflare.com";
const long gmtOffset_sec = 25200; // GMT+7 (Vietnam)
const int daylightOffset_sec = 0;

WiFiClient espClient;
PubSubClient client(espClient);
Servo myServo;

const uint32_t WIFI_RECONNECT_BASE_MS = 1000;
const uint32_t WIFI_RECONNECT_MAX_MS = 30000;

static bool wifiEverConnected = false;
static bool wifiAttemptInProgress = false;
static unsigned long lastWiFiAttemptMs = 0;
static uint32_t wifiBackoffMs = WIFI_RECONNECT_BASE_MS;
static uint8_t lastDisconnectReason = 0;
static unsigned long lastDisconnectAt = 0;

// Forward declarations
bool ensureWiFiConnected(uint32_t timeoutMs = 10000);
void startWiFiAttempt();
void onWiFiEvent(WiFiEvent_t event, WiFiEventInfo_t info);
const char* wifiDisconnectReasonToString(uint8_t reason);
String getISOTimestamp();

typedef struct struct_message {
    char device_id[32];
    char node_id[32];
    
    // DHT11 data
    float temperature;
    float humidity;
    
    // Light sensor
    int light_raw;
    float light_percent;
    
    // Rain sensor
    int rain_raw;
    float rain_percent;
    
    // Soil moisture
    int soil_raw;
    float soil_percent;
    
    // Metadata
    unsigned long sensor_timestamp;
    int rssi;
    bool dht_error;
    uint8_t message_type;
    uint32_t uptime_sec;
    uint32_t heartbeat_seq;
} struct_message;

struct_message myData;

String formatMac(const uint8_t *mac) {
    char buf[18];
    snprintf(buf, sizeof(buf), "%02X:%02X:%02X:%02X:%02X:%02X",
             mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
    return String(buf);
}

const char* wifiDisconnectReasonToString(uint8_t reason) {
    switch (reason) {
        case WIFI_REASON_AUTH_EXPIRE: return "AUTH_EXPIRE";
        case WIFI_REASON_AUTH_LEAVE: return "AUTH_LEAVE";
        case WIFI_REASON_ASSOC_EXPIRE: return "ASSOC_EXPIRE";
        case WIFI_REASON_ASSOC_TOOMANY: return "ASSOC_TOOMANY";
        case WIFI_REASON_NOT_AUTHED: return "NOT_AUTHED";
        case WIFI_REASON_NOT_ASSOCED: return "NOT_ASSOCED";
        case WIFI_REASON_ASSOC_LEAVE: return "ASSOC_LEAVE";
        case WIFI_REASON_BEACON_TIMEOUT: return "BEACON_TIMEOUT";
        case WIFI_REASON_NO_AP_FOUND: return "NO_AP_FOUND";
        case WIFI_REASON_AUTH_FAIL: return "AUTH_FAIL";
        case WIFI_REASON_ASSOC_FAIL: return "ASSOC_FAIL";
        case WIFI_REASON_HANDSHAKE_TIMEOUT: return "HANDSHAKE_TIMEOUT";
        case WIFI_REASON_CONNECTION_FAIL: return "CONNECTION_FAIL";
        default: return "UNKNOWN";
    }
}

void onWiFiEvent(WiFiEvent_t event, WiFiEventInfo_t info) {
    switch (event) {
        case ARDUINO_EVENT_WIFI_STA_CONNECTED:
            Serial.println("WiFi STA connected to AP");
            break;
        case ARDUINO_EVENT_WIFI_STA_GOT_IP:
            wifiAttemptInProgress = false;
            wifiEverConnected = true;
            wifiBackoffMs = WIFI_RECONNECT_BASE_MS;
            Serial.printf("WiFi connected: IP=%s RSSI=%d dBm\n",
                          WiFi.localIP().toString().c_str(), WiFi.RSSI());
            break;
        case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
            wifiAttemptInProgress = false;
            espNowReady = false;
            lastDisconnectReason = info.wifi_sta_disconnected.reason;
            lastDisconnectAt = millis();
            Serial.printf("WiFi disconnected (reason=%u %s)\n",
                          lastDisconnectReason,
                          wifiDisconnectReasonToString(lastDisconnectReason));
            break;
        default:
            break;
    }
}

void startWiFiAttempt() {
    if (WiFi.status() == WL_CONNECTED) {
        return;
    }
    if (wifiAttemptInProgress) {
        return;
    }

    unsigned long now = millis();
    if (now - lastWiFiAttemptMs < wifiBackoffMs) {
        return;
    }

    lastWiFiAttemptMs = now;
    wifiAttemptInProgress = true;
    Serial.printf("WiFi reconnect attempt (backoff %lu ms)\n", (unsigned long)wifiBackoffMs);

    if (!wifiEverConnected) {
        WiFi.begin(ssid, password);
    } else {
        WiFi.reconnect();
    }

    uint32_t nextBackoff = wifiBackoffMs * 2;
    wifiBackoffMs = min(nextBackoff, WIFI_RECONNECT_MAX_MS);
}

// Get ISO 8601 timestamp
String getISOTimestamp() {
    struct tm timeinfo;
    if(!getLocalTime(&timeinfo, 1000)){
        return String(millis()); // Fallback to millis if NTP fails
    }
    char buffer[30];
    strftime(buffer, sizeof(buffer), "%Y-%m-%dT%H:%M:%S", &timeinfo);
    return String(buffer) + "Z";
}

bool syncTime(uint32_t timeoutMs = 30000) {
    if (!ensureWiFiConnected()) {
        return false;
    }
    configTime(gmtOffset_sec, daylightOffset_sec, ntpServer1, ntpServer2, ntpServer3);
    struct tm timeinfo;
    uint32_t start = millis();
    while (millis() - start < timeoutMs) {
        if (getLocalTime(&timeinfo, 2000)) {
            if (timeinfo.tm_year >= (2016 - 1900)) {
                return true;
            }
        }
        delay(250);
    }
    return false;
}

bool ensureWiFiConnected(uint32_t timeoutMs) {
    if (WiFi.status() == WL_CONNECTED) {
        return true;
    }

    startWiFiAttempt();
    uint32_t start = millis();
    while (WiFi.status() != WL_CONNECTED && millis() - start < timeoutMs) {
        startWiFiAttempt();
        delay(250);
    }
    if (WiFi.status() == WL_CONNECTED) {
        return true;
    }
    return false;
}

bool connectMqttOnce() {
    if (!ensureWiFiConnected()) {
        return false;
    }
    Serial.print("Attempting MQTT connection...");
    String clientId = String(gateway_id) + "-" + String(random(0xffff), HEX);

    // Authenticate with credentials
    if (client.connect(clientId.c_str(), gateway_id, gateway_secret)) {
        Serial.println("âœ“ MQTT Connected");

        // Subscribe to command topic
        String commandTopic = "esp32/commands/" + String(gateway_id);
        client.subscribe(commandTopic.c_str());
        Serial.println("âœ“ Subscribed to: " + commandTopic);
        return true;
    }

    Serial.print("âœ— Failed, rc=");
    Serial.print(client.state());
    Serial.println(" retry in 5s");
    return false;
}

void waitForMqtt(uint32_t timeoutMs = 30000) {
    uint32_t start = millis();
    while (!client.connected() && millis() - start < timeoutMs) {
        if (connectMqttOnce()) {
            return;
        }
        delay(5000);
    }
}

// MQTT callback for incoming commands (Servo control)
void callback(char* topic, byte* payload, unsigned int length) {
    Serial.println("\n=== Command Received ===");
    Serial.print("Topic: ");
    Serial.println(topic);
    
    StaticJsonDocument<300> doc;
    DeserializationError error = deserializeJson(doc, payload, length);
    
    if (error) {
        Serial.println("âœ— JSON parse error");
        return;
    }
    
    // Check if command is for this gateway
    if (doc.containsKey("gateway_id") && 
        String((const char*)doc["gateway_id"]) != String(gateway_id)) {
        Serial.println("âœ— Command not for this gateway");
        return;
    }
    
    // Parse the 4 control variables
    if (doc.containsKey("action_type")) {
        String action = doc["action_type"];
        
        if (action == "servo_control") {
            int target_angle = doc["target_angle"] | 90; // Default 90
            int speed = doc["speed"] | 10; // Default speed 10
            String device_id = doc["device_id"] | "servo1";
            
