IoTCoreTeam/iot-core-esp32-gateway/src/main.cpp
            Serial.printf("âœ“ Servo Control: Device=%s, Angle=%d, Speed=%d\n", 
                         device_id.c_str(), target_angle, speed);
            
            // Apply speed control (optional - for smooth movement)
            int current_angle = myServo.read();
            int step = (target_angle > current_angle) ? 1 : -1;
            
            for (int pos = current_angle; pos != target_angle; pos += step) {
                myServo.write(pos);
                delay(15 / speed); // Speed affects delay
            }
            myServo.write(target_angle); // Ensure exact position
            
            Serial.println("âœ“ Servo moved successfully");
            
            // Send acknowledgment back to server
            StaticJsonDocument<200> ackDoc;
            ackDoc["gateway_id"] = gateway_id;
            ackDoc["device_id"] = device_id;
            ackDoc["status"] = "completed";
            ackDoc["current_angle"] = target_angle;
            ackDoc["timestamp"] = getISOTimestamp();
            
            String ackPayload;
            serializeJson(ackDoc, ackPayload);
            client.publish("esp32/servo/ack", ackPayload.c_str());
        } else if (action == ACTION_RELAY_CONTROL) {
            String device = doc["device"] | "";
            String state = doc["state"] | "";
            String targetNode = doc["node_id"] | CONTROL_NODE_ID;

            if (device != "pump" && device != "light") {
                Serial.println("relay_control invalid device");
                publishControlAck(targetNode.c_str(), device.c_str(), state.c_str(), "invalid_device");
                return;
            }
            if (state != "on" && state != "off") {
                Serial.println("relay_control invalid state");
                publishControlAck(targetNode.c_str(), device.c_str(), state.c_str(), "invalid_state");
                return;
            }

            sendControlCommandToNode(targetNode.c_str(), device.c_str(), state.c_str());
        }
    }
    Serial.println("========================\n");
}

// â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•
// UPDATED: ESP-NOW callback - Enhanced JSON format
// â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•

void OnDataRecv(const uint8_t *mac, const uint8_t *incomingData, int len) {
    Serial.println("\n=== ESP-NOW Data Received ===");
    
    memset(&myData, 0, sizeof(myData));
    int copyLen = len < (int)sizeof(myData) ? len : (int)sizeof(myData);
    memcpy(&myData, incomingData, copyLen);
    String nodeMac = formatMac(mac);

    if (myData.message_type == MSG_TYPE_HEARTBEAT) {
        if (!isNodeWhitelisted(myData.node_id)) {
            Serial.printf("Node heartbeat from non-whitelisted node: %s\n", myData.node_id);
        }
        const bool controlNode = isControlNode(myData.node_id);
        const char* heartbeatTopic = controlNode
            ? "esp32/controllers/heartbeat"
            : "esp32/nodes/heartbeat";

        Serial.printf("Heartbeat from node: %s\n", myData.node_id);
        Serial.printf("  Device: %s\n", myData.device_id);
        Serial.printf("  Uptime: %lu s\n", (unsigned long)myData.uptime_sec);
        Serial.printf("  RSSI: %d dBm\n", myData.rssi);

        StaticJsonDocument<300> heartbeat;
        heartbeat["type"] = "node_heartbeat";
        heartbeat["gateway_id"] = gateway_id;
        heartbeat["gateway_ip"] = WiFi.localIP().toString();
        heartbeat["gateway_mac"] = WiFi.macAddress();
        heartbeat["node_id"] = myData.node_id;
        heartbeat["node_name"] = controlNode ? "Control Node" : "Sensor Node";
        heartbeat["node_mac"] = nodeMac;
        heartbeat["sensor_id"] = myData.device_id;
        heartbeat["status"] = "online";
        heartbeat["uptime"] = myData.uptime_sec;
        heartbeat["heartbeat_seq"] = myData.heartbeat_seq;
        heartbeat["sensor_rssi"] = myData.rssi;
        heartbeat["gateway_timestamp"] = getISOTimestamp();
        heartbeat["sensor_timestamp"] = myData.sensor_timestamp;

        String hbPayload;
        serializeJson(heartbeat, hbPayload);

        if (client.connected()) {
            bool published = client.publish(heartbeatTopic, hbPayload.c_str(), true);
            if (published) {
                Serial.println("Node heartbeat published to MQTT");
            } else {
                Serial.println("Node heartbeat publish failed");
            }
        } else {
            Serial.println("MQTT disconnected, heartbeat not published");
        }

        Serial.println("=============================\n");
        return;
    }

    if (!isNodeWhitelisted(myData.node_id)) {
        Serial.printf("Node not in whitelist (dropping sensor data): %s\n", myData.node_id);
        return;
    }

    if (isControlNode(myData.node_id)) {
        Serial.printf("Ignoring non-heartbeat payload from control node: %s\n", myData.node_id);
        return;
    }

    Serial.printf("Device: %s\n", myData.device_id);
    Serial.printf("Node: %s\n", myData.node_id);
    
    // Print all sensor data
    if (!myData.dht_error) {
        Serial.printf("Temperature: %.1fÂ°C\n", myData.temperature);
        Serial.printf("Humidity: %.0f%%\n", myData.humidity);
    } else {
        Serial.println("DHT: ERROR");
    }
    
    Serial.printf("Light: %d (%d%%)\n", myData.light_raw, (int)myData.light_percent);
    Serial.printf("Rain: %d (%d%%)\n", myData.rain_raw, (int)myData.rain_percent);
    Serial.printf("Soil: %d (%d%%)\n", myData.soil_raw, (int)myData.soil_percent);
    Serial.printf("RSSI: %d dBm\n", myData.rssi);
    
    // â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•
    // Create ENHANCED JSON with all sensors
    // â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•
    
