IoTCoreTeam/iot-core-esp32-gateway/src/main.cpp
    StaticJsonDocument<800> doc;
    
    // Gateway info
    doc["gateway_id"] = gateway_id;
    doc["gateway_secret"] = gateway_secret;
    
    // Node info
    doc["node_id"] = myData.node_id;
    doc["node_name"] = "Sensor Node";
    
    // Device info
    doc["sensor_id"] = myData.device_id;
    
    // Sensor readings - DHT11
    if (!myData.dht_error) {
        doc["temperature"] = round(myData.temperature * 10) / 10.0;
        doc["humidity"] = (int)myData.humidity;
    } else {
        doc["temperature"] = nullptr;
        doc["humidity"] = nullptr;
        doc["dht_error"] = true;
    }
    
    // Light sensor
    JsonObject light = doc.createNestedObject("light");
    light["raw"] = myData.light_raw;
    light["percent"] = (int)myData.light_percent;
    light["unit"] = "%";
    
    // Rain sensor
    JsonObject rain = doc.createNestedObject("rain");
    rain["raw"] = myData.rain_raw;
    rain["percent"] = (int)myData.rain_percent;
    rain["unit"] = "%";
    
    // Soil moisture
    JsonObject soil = doc.createNestedObject("soil");
    soil["raw"] = myData.soil_raw;
    soil["percent"] = (int)myData.soil_percent;
    soil["unit"] = "%";
    
    // Timestamps
    doc["sensor_timestamp"] = myData.sensor_timestamp;
    doc["gateway_timestamp"] = getISOTimestamp();
    
    // Metadata
    doc["sensor_rssi"] = myData.rssi;
    doc["gateway_rssi"] = WiFi.RSSI();
    
    String payload;
    serializeJson(doc, payload);
    
    Serial.println("\nðŸ“¤ JSON Payload:");
    Serial.println(payload);
    
    // Publish to MQTT with QoS 1
    if (client.connected()) {
        bool published = client.publish("esp32/sensors/data", payload.c_str(), true);
        if (published) {
            Serial.println("âœ“ Published to MQTT");
        } else {
            Serial.println("âœ— MQTT publish failed");
        }
    } else {
        Serial.println("âœ— MQTT disconnected, will retry in loop");
    }
    Serial.println("=============================\n");
}

void setup() {
    Serial.begin(115200);
    delay(1000);
    Serial.println("\nâ•”â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•—");
    Serial.println("â•‘   IoT Gateway Starting...    â•‘");
    Serial.println("â•šâ•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•\n");
    
    // WiFi Setup
    WiFi.mode(WIFI_STA);
    WiFi.setAutoReconnect(true);
    WiFi.persistent(false);
    WiFi.setSleep(false);
    WiFi.onEvent(onWiFiEvent);
    WiFi.disconnect(true, true);
    delay(200);
    
    // Connect to WiFi first
    Serial.println("[1/6] Connecting to WiFi...");
    startWiFiAttempt();

    if (!ensureWiFiConnected(20000)) {
        Serial.println("âœ— WiFi connection failed!");
        if (lastDisconnectReason != 0) {
            Serial.printf("  Last reason: %u (%s)\n",
                          lastDisconnectReason,
                          wifiDisconnectReasonToString(lastDisconnectReason));
        }
        return;
    }

    Serial.println("âœ“ WiFi connected");
    Serial.print("  IP: ");
    Serial.println(WiFi.localIP());
    Serial.print("  Channel: ");
    Serial.println(WiFi.channel());
    Serial.print("  MAC: ");
    Serial.println(WiFi.macAddress());
    
    // Disable power saving
    esp_wifi_set_ps(WIFI_PS_NONE);

    // Initialize ESP-NOW after WiFi is up
    Serial.println("[2/6] Initializing ESP-NOW...");
    if (!ensureEspNowReady()) {
        Serial.println("âœ— ESP-NOW init failed!");
        return;
    }
    Serial.println("âœ“ ESP-NOW ready");
    
    // Initialize NTP for timestamps
    Serial.println("[3/6] Syncing time with NTP...");
    if (syncTime()) {
        Serial.println("âœ“ Time synchronized");
        Serial.print("  Current time: ");
        Serial.println(getISOTimestamp());
    } else {
        Serial.println("âš  NTP sync failed, using millis()");
    }
    
    // Setup MQTT
    Serial.println("[4/6] Configuring MQTT...");
    client.setSocketTimeout(15);
    client.setKeepAlive(60);
    client.setServer(mqtt_server, 1883);
    client.setCallback(callback);
    Serial.println("âœ“ MQTT configured");

    client.setBufferSize(1024);
    
    // Setup Servo
    Serial.println("[5/6] Initializing servo...");
    myServo.attach(18);
    myServo.write(90); // Center position
    Serial.println("âœ“ Servo ready (pin 18, position 90Â°)");
    
    // Connect to MQTT
    Serial.println("[6/6] Connecting to MQTT broker...");
    waitForMqtt();
    
    Serial.println("\nâ•”â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•—");
    Serial.println("â•‘  Gateway Ready - ID: " + String(gateway_id) + "  â•‘");
    Serial.println("â•šâ•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•\n");
}

void loop() {
    if (WiFi.status() != WL_CONNECTED) {
        startWiFiAttempt();
    }

    static unsigned long lastMqttAttempt = 0;
    if (!client.connected()) {
        if (millis() - lastMqttAttempt >= 5000) {
            lastMqttAttempt = millis();
            connectMqttOnce();
        }
    } else {
        client.loop();
    }
    
    // Heartbeat every 5 seconds
    static unsigned long lastHeartbeat = 0;
    if (millis() - lastHeartbeat > 5000) {
        StaticJsonDocument<200> heartbeat;
        heartbeat["gateway_id"] = gateway_id;
        heartbeat["status"] = "online";
        heartbeat["uptime"] = millis() / 1000;
        heartbeat["timestamp"] = getISOTimestamp();
        
        String payload;
        serializeJson(heartbeat, payload);
        client.publish("esp32/heartbeat", payload.c_str());
        
        lastHeartbeat = millis();
    }
}

